app/Helpers/campus_helper.php

SELECT `campus_expiry`, `bill_id`, `plan_id`, `bill_issue_date`
FROM `campus_bills`
WHERE `campus_id` = '11'
AND `status` = 1
ORDER BY `bill_id` DESC
---
    function getCampusExpiryInfo($campusId)
    {
        $db = \Config\Database::connect();

        // Get the latest active bill (status = 1) for this campus
        $latestBill = $db->table('campus_bills')
            ->select('campus_expiry, bill_id, plan_id, bill_issue_date')
            ->where('campus_id', $campusId)
            ->where('status', 1)
            ->orderBy('bill_id', 'DESC')
            ->get()
            ->getRow();