app/Helpers/server_helper.php

    function getLoginUser()
    {
        $session = \Config\Services::session();
        $db = \Config\Database::connect();

        $userId = $session->get('member_userid');
        if (!$userId) {
            return null;
        }

        $builder = $db->table('users');
        $user = $builder->where('id', $userId)->get()->getRow();
---
SELECT *
FROM `users`
WHERE `id` = '139'