app/Controllers/BaseController.php

SELECT *
FROM `academic_session`
WHERE `system_id` = '7'
SELECT *
FROM `campus`
WHERE `system_id` = '7'
---
    public function headerData(): string
    {
        $db       = $this->db;
        $session  = $this->session;
        $school   = getSchoolInfo();

        $curr_session_id = $session->get('member_sessionid');
        $curr_campus_id  = $session->get('member_campusid');

        $academic_sessions = [];
        $campuses          = [];

        if ($school && $school->system_id) {
            $academic_sessions = $db->table('academic_session')
                ->where('system_id', $school->system_id)
                ->get()->getResult();

            $campuses = $db->table('campus')
                ->where('system_id', $school->system_id)
                ->get()->getResult();