app/Libraries/MemberCurrentUser.php

SELECT *
FROM `users`
WHERE `id` = '139'
---
    public static function user()
    {
        $session = Services::session();
        $db      = db_connect();

        if ($session->get('member_userid')) {
            $builder = $db->table('users')
                          ->where('id', $session->get('member_userid'));
            $user1 = $builder->get()->getRow();