app/Views/layouts/header.php

SELECT `t_flag`, `h_flag`, `a_flag`
FROM `campus`
WHERE `campus_id` = 11
---
$hasTransport = $hasHostel = $hasAcademy = false;
if ($curr_campus_id) {
    $db = \Config\Database::connect();
    $flags = $db->table('campus')
        ->select('t_flag, h_flag, a_flag')
        ->where('campus_id', $curr_campus_id)
        ->get()->getRow();

SELECT *
FROM `system_plans`
WHERE `plan_id` = '3'
---
        $plan_id           = $currentCampusBill->plan_id ?? 0;

        $builder  = $db->table('system_plans');
        $plan_info = $builder->where('plan_id', $plan_id)->get()->getRow();

SELECT *
FROM `role_name`
WHERE `role_name_id` = '4'
---
        $role_name_info = null;
        if ($currentuserrole) {
            $role_builder = $db->table('role_name');
            $role_name_info = $role_builder->where('role_name_id', $currentuserrole->roleID)->get()->getRow();

SELECT `t_flag`, `h_flag`, `a_flag`
FROM `campus`
WHERE `campus_id` = 11
---

  $hasTransport = $hasHostel = $hasAcademy = false;
  if ($curr_campus_id) {
      $flags = $db->table('campus')
          ->select('t_flag, h_flag, a_flag')
          ->where('campus_id', $curr_campus_id)
          ->get()->getRow();